examples/flights/L2_100mm_Rolly_Polly_V/cfd/case_template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Domain dimensions (meters) -- 100mm L2 rocket fin
// Fin geometry (CFD frame): X=[0, 0.1104] span, Y=[-0.012, 0.0125] thickness,
//                           Z=[0.010, 0.160] chord (LE at Z=0.010, flow +Z)
// Tab: X=[0.0547, 0.0787] span, Z=[0.100, 0.160]; TE swings +-0.019 in Y at 20 deg
// xMin = +0.001: flat wall simulating the body surface at the fin root.
// The fin root (X=0) is embedded 1 mm below the wall so the root face is
// outside the domain (no gap under the root).
xMin    0.001;
xMax    0.28;
yMin   -0.20;
yMax    0.20;
zMin   -0.25;
zMax    0.65;

// Base cell size ~10mm -> 28x40x90 = 100,800 background cells
vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)
    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (28 40 90) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)   // zMin face -- flow enters from below (upstream)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)   // zMax face -- flow exits above (downstream)
        );
    }

    bodyTube
    {
        type wall;
        faces
        (
            (0 4 7 3)   // xMin face = body surface wall at fin root
        );
    }

    farfield
    {
        type patch;
        faces
        (
            (0 1 5 4)   // yMin
            (2 3 7 6)   // yMax
            (1 2 6 5)   // xMax
        );
    }
);
