examples/flights/L2_100mm_Rolly_Polly_V/cfd/case_template/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

// Air at sea level, 15C
nu              nu [ 0 2 -1 0 0 0 0 ] 1.5e-05;
