examples/flights/L2_100mm_Rolly_Polly_V/cfd/case_template/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    farfield
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    bodyTube
    {
        type            zeroGradient;
    }

    fincan
    {
        type            zeroGradient;
    }

    finTab
    {
        type            zeroGradient;
    }
}
