examples/flights/L2_100mm_Rolly_Polly_V/cfd/case_template/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  4;

method          scotch;
